/*******************************************************************************
** 文件名: 		stm32f10x_it.h
** 版本：  		1.0
** 工作环境: 	RealView MDK-ARM 4.20
** 作者: 		XXX
** 生成日期: 	2011-04-10
** 功能:		中断头文件声明
** 相关文件:	无
** 修改日志：	2011-04-10   创建文档
*******************************************************************************/
/* 防止重定义-----------------------------------------------------------------*/
#ifndef __STM32F10x_IT_H
#define __STM32F10x_IT_H

/* 包含的头文件---------------------------------------------------------------*/
#include "stm32f10x.h"

/* 类型定义 ------------------------------------------------------------------*/
/* 常量定义 ------------------------------------------------------------------*/
/* 宏定义 --------------------------------------------------------------------*/
/* 函数定义------------------------------------------------------------------ */

void NMI_Handler(void);
void HardFault_Handler(void);
void MemManage_Handler(void);
void BusFault_Handler(void);
void UsageFault_Handler(void);
void SVC_Handler(void);
void DebugMon_Handler(void);
void PendSV_Handler(void);
void SysTick_Handler(void);

#endif /* __STM32F10x_IT_H */

/************************************文件结束*********************************/
